XuLibo1129/zhi-hu-an-ju-health-guardian/firmware/main-terminal/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# This ESP32-P4-Function-EV-Board reports chip revision v1.3.
# ESP32-P4 rev <3.0 and rev >=3.0 images are mutually exclusive in ESP-IDF.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# ESP32-P4-Function-EV-Board v1.5.2 has 16 MB SPI flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# LVGL + MIPI-DSI frame buffers need external RAM on this board.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Leave enough room for BSP/LVGL demo firmware.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# The official 7-inch LCD kit is 1024x600 MIPI-DSI.
CONFIG_BSP_LCD_TYPE_1024_600=y
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_DIRECT_MODE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ESP32-P4-Function-EV-Board uses the on-board ESP32-C6-MINI-1 over SDIO for Wi-Fi.
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32H2 is not set
# CONFIG_ESP_HOSTED_SPI_HOST_INTERFACE is not set
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_SLOT=1
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=16
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54

# Larger numeric fonts; Chinese UI text uses main/ui_font_cn_20.c.
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=y

# Tencent Cloud ASR relay works best with 16 kHz mono PCM/WAV.
CONFIG_APP_AUDIO_SAMPLE_RATE=16000
CONFIG_APP_CLOUD_TTS_SAMPLE_RATE=16000
CONFIG_APP_AUDIO_RECORD_MAX_MS=6000
CONFIG_APP_CLOUD_ASR_ENABLE=y
CONFIG_APP_CLOUD_TTS_ENABLE=y

# Receive ESP32-S3 WiFi CSI inference results from the local PC.
CONFIG_APP_CSI_HTTP_ENABLE=y
CONFIG_APP_CSI_HTTP_PORT=8090
CONFIG_APP_CSI_HTTP_MAX_BODY=1024

# Fixed Nanjing Jiangbei New Area weather is more reliable than public-IP geolocation.
# CONFIG_APP_WEATHER_AUTO_LOCATION is not set
CONFIG_APP_WEATHER_FIXED_LATITUDE="32.0805"
CONFIG_APP_WEATHER_FIXED_LONGITUDE="118.6729"

# K230 visual fall-detection result receiver.
CONFIG_APP_K230_VISION_ENABLE=y
CONFIG_APP_K230_VISION_UART_NUM=3
CONFIG_APP_K230_VISION_UART_RX_GPIO=20
CONFIG_APP_K230_VISION_UART_BAUD=115200

# A7670C LTE emergency call/SMS module.
CONFIG_APP_SIM800_ENABLE=y
CONFIG_APP_SIM800_AUTO_SMS_ENABLE=y
CONFIG_APP_SIM800_AUTO_CALL_ENABLE=y
CONFIG_APP_SIM800_AUTO_COOLDOWN_SECONDS=300
CONFIG_APP_WEATHER_FIXED_CITY="南京市江北新区"
CONFIG_APP_WEATHER_CHINA_STATION_ID="101190107"
